Revit 2026 API

# FormulaEditingEventArgsApply Method

---

Applies formula to the parameter

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Apply(
	string formula
)
```
```vb
Public Sub Apply (
	formula As String
)
```
```cpp
public:
void Apply(
	String^ formula
)
```
```fsharp
member Apply :
        formula : string -> unit
```

#### Parameters

formula String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FormulaEditingEventArgs Class

Autodesk.Revit.UI.Events Namespace